package org.wtcm.programmers.september;


/* note.
    Question.
        모든 원소가 0,1로 이루어진 크기가 같은 2차원 배열 a,b에 대해 가능한 b의 모든 경우의 수를 (10^7+19)로 나눈 나머지를 return해라.
        조건)
            1. i = 1, 2, ..., (a의 열의 갯수) 에 대해서 a의 i번째 열과 b의 i번째 열에 들어있는 1의 갯수가 같다.
            2. b의 각 행에 들어 있는 1의 갯수가 짝수이다. (0도 짝수)
        제한사항)
            1. a의 행의 갯수는 1이상 300 이하
            2. a의 각 행의 길이는 1이상 300 이하로 모두 동일함.
        e.g)
            a = [[0,1,0], [1,1,1], [1,1,0], [0,1,1]] | answer : 6
            a = [[1,0,0], [1,0,0]] | answer : 0
            a = [[1,0,0,1,1], [0,0,0,0,0], [1,1,0,0,0], [0,0,0,0,1]] | answer : 72

*
* */
public class Q4 {
//    static int[][] a = {{0,1,0},{1,1,1},{1,1,0},{0,1,1}};
//    static int[][] a = {{1,0,0},{1,0,0}};
    static int[][] a = {{1,0,0,1,1},{0,0,0,0,0},{1,1,0,0,0},{0,0,0,0,1}};
    public static void main(String[] args) {

    }
}
